; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v1 ?v8)
             (pred_6 ?v10 ?v13)
             (pred_1 ?v1 ?v13)
             (pred_2 ?v4 ?v1 )
	     (pred_11 ?v1)
             (pred_7 ?v5)
             (pred_4 ?v10)
             (pred_8 ?v13)
             (pred_5 ?v1)
             (pred_3 ?v10)
             (pred_10 ?v1)
             (pred_12 ))



(:action op_3
:parameters (?v3 ?v9 ?v6 ?v7)
:precondition (and (pred_7 ?v3) (pred_7 ?v9) (pred_4 ?v6) (pred_8 ?v7)
          (pred_9 ?v3 ?v9) (pred_6 ?v6 ?v7)
                   (pred_1 ?v9 ?v7) (pred_11 ?v3) 
                   (pred_5 ?v9) (pred_3 ?v6))
:effect (and  (pred_10 ?v9) (not (pred_5 ?v9))))


(:action op_1
:parameters (?v3 ?v12)
:precondition (and (pred_7 ?v3) (pred_7 ?v12)
               (pred_11 ?v3) (pred_9 ?v3 ?v12) (pred_10 ?v12))
:effect (and (pred_11 ?v12) (not (pred_11 ?v3))))

(:action op_2
:parameters (?v3 ?v6)
:precondition (and (pred_7 ?v3) (pred_4 ?v6) 
                  (pred_11 ?v3) (pred_2 ?v6 ?v3) (pred_12 ))
:effect (and (pred_3 ?v6)
   (not (pred_2 ?v6 ?v3)) (not (pred_12 ))))


(:action op_4
:parameters (?v3 ?v2 ?v11)
:precondition (and (pred_7 ?v3) (pred_4 ?v2) (pred_4 ?v11)
                  (pred_11 ?v3) (pred_3 ?v11) (pred_2 ?v2 ?v3))
:effect (and (pred_3 ?v2) (pred_2 ?v11 ?v3)
        (not (pred_3 ?v11)) (not (pred_2 ?v2 ?v3))))

(:action op_5
:parameters (?v3 ?v6)
:precondition (and (pred_7 ?v3) (pred_4 ?v6) 
                  (pred_11 ?v3) (pred_3 ?v6))
:effect (and (pred_12 ) (pred_2 ?v6 ?v3) (not (pred_3 ?v6)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_13 obj_02 obj_06 obj_11 obj_10 obj_07 obj_01 obj_04 obj_05
    obj_08 obj_03
    obj_12 obj_09
    )

    (:init
       (pred_12)

       (pred_7 obj_13)
       (pred_7 obj_02)
       (pred_7 obj_06)
       (pred_7 obj_11)
       (pred_7 obj_10)
       (pred_7 obj_07)
       (pred_7 obj_01)
       (pred_7 obj_04)
       (pred_7 obj_05)
       (pred_8 obj_08)
       (pred_8 obj_03)
       (pred_4 obj_12)
       (pred_4 obj_09)

       (pred_9 obj_13 obj_11)
       (pred_9 obj_13 obj_02)
       (pred_9 obj_02 obj_10)
       (pred_9 obj_02 obj_06)
       (pred_9 obj_02 obj_13)
       (pred_9 obj_06 obj_07)
       (pred_9 obj_06 obj_02)
       (pred_9 obj_11 obj_01)
       (pred_9 obj_11 obj_10)
       (pred_9 obj_11 obj_13)
       (pred_9 obj_10 obj_04)
       (pred_9 obj_10 obj_07)
       (pred_9 obj_10 obj_02)
       (pred_9 obj_10 obj_11)
       (pred_9 obj_07 obj_05)
       (pred_9 obj_07 obj_06)
       (pred_9 obj_07 obj_10)
       (pred_9 obj_01 obj_04)
       (pred_9 obj_01 obj_11)
       (pred_9 obj_04 obj_05)
       (pred_9 obj_04 obj_10)
       (pred_9 obj_04 obj_01)
       (pred_9 obj_05 obj_07)
       (pred_9 obj_05 obj_04)
       (pred_5 obj_01)
       (pred_5 obj_13)
       (pred_1  obj_01 obj_08)
       (pred_1  obj_13 obj_03)
       (pred_10 obj_02)
       (pred_10 obj_06)
       (pred_10 obj_11)
       (pred_10 obj_10)
       (pred_10 obj_07)
       (pred_10 obj_04)
       (pred_10 obj_05)

       (pred_6  obj_12 obj_08)
       (pred_6  obj_09 obj_03)
       (pred_2 obj_12 obj_11)
       (pred_2 obj_09 obj_04)
       (pred_11 obj_06)
    )

    (:goal (and
       (pred_2 obj_09 obj_07)
    ))
(:constraints
  (always (not (pred_11 obj_10)))
)
)

; plan
1. (op_1 obj_06 obj_07)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_07)
   goals met: 0 of 1
2. (op_1 obj_07 obj_05)
   deleted: (pred_11 obj_07)
   added: (pred_11 obj_05)
   goals met: 0 of 1
3. (op_1 obj_05 obj_04)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_04)
   goals met: 0 of 1
4. (op_2 obj_04 obj_09)
   deleted: (pred_2 obj_09 obj_04) (pred_12)
   added: (pred_3 obj_09)
   goals met: 0 of 1
5. (op_1 obj_04 obj_05)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_05)
   goals met: 0 of 1
6. (op_1 obj_05 obj_07)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_07)
   goals met: 0 of 1
7. (op_5 obj_07 obj_09)
   deleted: (pred_3 obj_09)
   added: (pred_12) (pred_2 obj_09 obj_07)
   goals met: 1 of 1
